{/*import React, { Component } from 'react';

export let store = {
  
  neoflorumCounter(age) {
    if (age < 12) {
      return "Неофлорум, по 1 капсулі, 1 р./д."
    } else {
      return "Неофлорум, по 1 капсулі, 2 р./д."
    }
  }

  nurofenCounter(age) {
    if (age < 1) {
      return "Нурофен, сироп, по 2,5мл, 3 р./д."
    } else if (age < 4) {
      return "Нурофен, сироп, по 5мл, 3 р./д."
    }
    else if (age < 7) {
      return "Нурофен, сироп, по 7,5мл, 3 р./д."
    }
    else if (age < 10) {
      return "Нурофен, сироп, по 10мл, 3 р./д."
    }
    else if (age < 12) {
      return "Нурофен, сироп, по 15мл, 3 р./д."
    }
    else return "Ібупрофен(200мг), таблетки, по 1 таб., 3 р./д."
  }

  amoxyclavCounter(weight) {
    let dose = weight / 6
    if (weight < 40) {
      return "Амоксиклав(250/62.5мг), по " + dose.toFixed() + " мл, 3 р/д"
    }
    else return "Амоксиклав(500/125мг), таблетки, по 1 таб., 2 р/д"
  }

  
  doctor = "Куц О.В. "
  surgeon = this.doctor
  asistant = "-"
  cardNumber = 2255
  name = "Левченко Лев Левович"
  complaints = "наявність болючої припухлості в ділянці щоки праворуч, загальне знедужання, підвищення температури тіла."
  anamnesisMorbi = {
    days: 3,
    createContent: function () { return ("зі слів батьків хворіє " + this.days + "-й день; захворювання почалось із болі у правому верхньому кутньому зубі.") },
  }
  anamnesisVitae = {
    pregnancy: 1,
    childbirth: 1,
    weight: 3600,
    createContent: function () { return ("дитина від " + this.pregnancy + "-ої вагітності, пологи " + this.childbirth + "-і , вага при народженні " + this.weight + "г. У  психомоторному розвитку від однолітків не відстає. Перенесені дитячі інфекційні захворювання (вітряна віспа, кір, скарлатина, кашлюк, епід. паротит, гепатит A,B,C,D), зі слів батьків,  заперечують. Профілактичні щеплення   проведені  , зі слів батьків,  проведені не в повному обсязі . Алергологічний анамнез не обтяжений.  Спадковий анамнез не обтяжений).  Останні 21 день в контакті з інфекційними хворими не перебував, розладів стільця у дитини та членів сім'ї не спостерігалося. ") },
  }
  statusPraesens = {
    generalCondition: "середнього ",
    heartRate: 96,
    respiratoryRate: 24,
    createContent: function () { return ("загальний стан дитини " + this.generalCondition + "ступеню важкості. Свідомість ясна. Поведінка неадекватна. Положення активне. Живлення звичайне. Шкірні покриви чисті. Шкіра помірної вологості. Щитоподібна залоза не збільшена. Серце: межі відносної та абсолютної тупості відповідають нормі. ЧСС=" + this.heartRate + "/хв. Над легенями перкуторно ясний легеневий звук. Везикулярне дихання. ЧДР=" + this.respiratoryRate + "/хв. Живіт при пальпації м’який, безболісний. Печінка не збільшена. Нирки та селезінка не пальпуються. Випорожнення оформлені, без патологічних домішок, раз на день. Сечопуск вільний, регулярний, безболісний.") },
  }
  statusLocalis = {
    toothNumber: 55,
    bite: "Тимчасовий",
    crownDestruction: "частково",
    createContent: function () { return ("обличчя  асиметричне (за рахунок колатерального  набряку верхньої третини щічної ділянки  та підочної ділянки праворуч). Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Шкіра обличчя звичайного кольору, помірно зволожена. Регіонарні лімфовузли не пальпуються. Відкривання рота в повному обсязі. " + this.bite + " прикус.  Слизова оболонка ротової порожнини в загальному блідо-рожева, проте гіперемійована та набрякла в ділянці перехідної складки 54,55 зубів, випукла, різко болісна при пальпації. Коронка " + this.toothNumber + " зуба " + this.crownDestruction + " зруйнована карієсом, перкусія його різко болісна.") },
  }
  diagnosis = {
    toothNumber: 55,
    createContent: function () { return ("гострий гнійний одонтогенний періостит верхньої щелепи праворуч від R" + this.toothNumber + " зуба.") }
  }

  operation = {
    name: "Розкриття та дренування періоститу верхньої щелепи праворуч",
    protocolNumber: 333,
    date: "08.08.19",
    time: "14:30",
    time2: "17:00",
    toothNumber: 55,
    area: "54,55",
    tools: "S-подібних щипців",
    duration: 15,
    anesthetist: "Голінка Ю.Я.",
    createContent: function () {
      return ("Загальне знеболення. Обробка приротової ділянки спиртом двічі, в роті 3% розчином перекисю водню. Проведено розріз до кістки паралельно до перехідної складки в ділянці " + this.area + " зубів, довжиною приблизно 2 см. Тупо москітним затискачем розширено краї рани та пройдено до гнійного осередку. Гнійний вміст об’ємом приблизно 2 мл забрано на бак.посів. Рана дренована гумовим випускником. Видалено " + this.toothNumber + " зуб з допомогою " + this.tools + ". На верхівках коренів видаленого зуба виявлені множинні дрібні гранульоми. Гемостаз по ходу операції. Дитина переведена в палату зі задовільними показниками гемодинаміки.")
    }
  */}


/*
    neoflorumCounter(age) {
      if (age < 12) {
        return "Неофлорум, по 1 капсулі, 1 р./д."
      } else {
        return "Неофлорум, по 1 капсулі, 2 р./д."
      }
    }
  
    nurofenCounter(age) {
      if (age < 1) {
        return "Нурофен, сироп, по 2,5мл, 3 р./д."
      } else if (age < 4) {
        return "Нурофен, сироп, по 5мл, 3 р./д."
      }
      else if (age < 7) {
        return "Нурофен, сироп, по 7,5мл, 3 р./д."
      }
      else if (age < 10) {
        return "Нурофен, сироп, по 10мл, 3 р./д."
      }
      else if (age < 12) {
        return "Нурофен, сироп, по 15мл, 3 р./д."
      }
      else return "Ібупрофен(200мг), таблетки, по 1 таб., 3 р./д."
    }
  
    amoxyclavCounter(weight) {
      let dose = weight / 6
      if (weight < 40) {
        return "Амоксиклав(250/62.5мг), по " + dose.toFixed() + " мл, 3 р/д"
      }
      else return "Амоксиклав(500/125мг), таблетки, по 1 таб., 2 р/д"
    }
  
  
  
  
    Model = function (type, complaints, anamnesisMorbi, anamnesisVitae, statusPraesens, statusLocalis, diagnosis, operation) {
      this.type = type;
      this.doctor = "Куц О.В.";
      this.surgeon = "Куц О.В.";
      this.assistant = "-";
      this.cardNumber = 1111;
      this.name = "Левченко Лев Левович";
      this.complaints = complaints;
      this.anamnesisMorbi = anamnesisMorbi;
      this.anamnesisVitae = anamnesisVitae;
      this.statusPraesens = statusPraesens;
      this.statusLocalis = statusLocalis;
      this.diagnosis = diagnosis;
      this.operation = operation;
    }
  
  
  
    periostit1 = new this.Model(
      "periostit1",
      "наявність болючої припухлості в ділянці щоки праворуч, загальне знедужання, підвищення температури тіла.",
      {
        days: 3,
        createContent: function () { return ("зі слів батьків хворіє " + this.days + "--й  день; захворювання почалось із болі у правому верхньому кутньому зубі.") },
      }
      , {
        pregnancy: 1,
        childbirth: 1,
        weight: 3600,
        createContent: function () { return ("дитина від " + this.pregnancy + "-ої вагітності, пологи " + this.childbirth + "-і , вага при народженні " + this.weight + "г. У  психомоторному розвитку від однолітків не відстає. Перенесені дитячі інфекційні захворювання (вітряна віспа, кір, скарлатина, кашлюк, епід. паротит, гепатит A,B,C,D), зі слів батьків,  заперечують. Профілактичні щеплення   проведені  , зі слів батьків,  проведені не в повному обсязі . Алергологічний анамнез не обтяжений.  Спадковий анамнез не обтяжений).  Останні 21 день в контакті з інфекційними хворими не перебував, розладів стільця у дитини та членів сім'ї не спостерігалося. ") },
      },
      {
        generalCondition: "середнього ",
        age: 7,
        heartRateCounter: function (age) {
          switch (age) {
            case 0: return 130;
              break;
            case 1: return 115;
              break;
            case 2:
            case 3: return 110;
              break;
            case 4:
            case 5: return 100;
              break;
            case 6: case 7: return 95;
              break;
            case 8: case 9: return 85;
              break;
            case 10: case 11: return 80;
              break;
            case 12: case 13: case 14: return 70;
              break;
            default: return 65
          }
        },
        respiratoryRateCounter: function (age) {
          switch (age) {
            case 0: return 35;
              break;
            case 1: case 2: case 3: return 30;
              break;
            case 4: case 5: case 6: return 25;
              break;
            case 7: case 8: case 9: return 22;
              break;
            case 10: case 11: case 12: return 20;
              break;
            case 13: case 14: case 15: return 18;
              break;
            default: return 16
          }
        },
        createContent: function () { return ("загальний стан дитини " + this.generalCondition + "ступеню важкості. Свідомість ясна. Поведінка неадекватна. Положення активне. Живлення звичайне. Шкірні покриви чисті. Шкіра помірної вологості. Щитоподібна залоза не збільшена. Серце: межі відносної та абсолютної тупості відповідають нормі. ЧСС=" + this.heartRateCounter(this.age) + "/хв. Над легенями перкуторно ясний легеневий звук. Везикулярне дихання. ЧДР=" + this.respiratoryRateCounter(this.age) + "/хв. Живіт при пальпації м’який, безболісний. Печінка не збільшена. Нирки та селезінка не пальпуються. Випорожнення оформлені, без патологічних домішок, раз на день. Сечопуск вільний, регулярний, безболісний.") },
      },
      {
        toothNumber: 55,
        bite: "Тимчасовий",
        crownDestruction: "частково",
        createContent: function () { return ("обличчя  асиметричне (за рахунок колатерального  набряку верхньої третини щічної ділянки  та підочної ділянки праворуч). Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Шкіра обличчя звичайного кольору, помірно зволожена. Регіонарні лімфовузли не пальпуються. Відкривання рота в повному обсязі. " + this.bite + " прикус.  Слизова оболонка ротової порожнини в загальному блідо-рожева, проте гіперемійована та набрякла в ділянці перехідної складки 54,55 зубів, випукла, різко болісна при пальпації. Коронка " + this.toothNumber + " зуба " + this.crownDestruction + " зруйнована карієсом, перкусія його різко болісна.") },
      },
      {
        toothNumber: 55,
        createContent: function () { return ("гострий гнійний одонтогенний періостит верхньої щелепи праворуч від R" + this.toothNumber + " зуба.") }
      },
      {
        name: "Розкриття та дренування періоститу верхньої щелепи праворуч",
        protocolNumber: 333,
        date: "08.08.19",
        time: "14:30",
        time2: "17:00",
        toothNumber: 55,
        area: "54,55",
        tools: "S-подібних щипців",
        duration: 15,
        anesthetist: "Голінка Ю.Я.",
        createContent: function () {
          return ("Загальне знеболення. Обробка приротової ділянки спиртом двічі, в роті 3% розчином перекисю водню. Проведено розріз до кістки паралельно до перехідної складки в ділянці " + this.area + " зубів, довжиною приблизно 2 см. Тупо москітним затискачем розширено краї рани та пройдено до гнійного осередку. Гнійний вміст об’ємом приблизно 2 мл забрано на бак.посів. Рана дренована гумовим випускником. Видалено " + this.toothNumber + " зуб з допомогою " + this.tools + ". На верхівках коренів видаленого зуба виявлені множинні дрібні гранульоми. Гемостаз по ходу операції. Дитина переведена в палату зі задовільними показниками гемодинаміки.")
        }
      }
    )
    periostit2 = new this.Model(
      "periostit2",
      "наявність болючої припухлості в ділянці щоки ліворуч, загальне знедужання, підвищення температури тіла.",
      {
        days: 3,
        createContent: function () { return ("зі слів батьків хворіє " + this.days + "--й  день; захворювання почалось із болі у лівому верхньому кутньому зубі.") },
      }
      , {
        pregnancy: 1,
        childbirth: 1,
        weight: 3600,
        createContent: function () { return ("дитина від " + this.pregnancy + "-ої вагітності, пологи " + this.childbirth + "-і , вага при народженні " + this.weight + "г. У  психомоторному розвитку від однолітків не відстає. Перенесені дитячі інфекційні захворювання (вітряна віспа, кір, скарлатина, кашлюк, епід. паротит, гепатит A,B,C,D), зі слів батьків,  заперечують. Профілактичні щеплення   проведені  , зі слів батьків,  проведені не в повному обсязі . Алергологічний анамнез не обтяжений.  Спадковий анамнез не обтяжений).  Останні 21 день в контакті з інфекційними хворими не перебував, розладів стільця у дитини та членів сім'ї не спостерігалося. ") },
      },
      {
        generalCondition: "середнього ",
        heartRate: 96,
        respiratoryRate: 24,
        createContent: function () { return ("загальний стан дитини " + this.generalCondition + "ступеню важкості. Свідомість ясна. Поведінка неадекватна. Положення активне. Живлення звичайне. Шкірні покриви чисті. Шкіра помірної вологості. Щитоподібна залоза не збільшена. Серце: межі відносної та абсолютної тупості відповідають нормі. ЧСС=" + this.heartRate + "/хв. Над легенями перкуторно ясний легеневий звук. Везикулярне дихання. ЧДР=" + this.respiratoryRate + "/хв. Живіт при пальпації м’який, безболісний. Печінка не збільшена. Нирки та селезінка не пальпуються. Випорожнення оформлені, без патологічних домішок, раз на день. Сечопуск вільний, регулярний, безболісний.") },
      },
      {
        toothNumber: 65,
        bite: "Тимчасовий",
        crownDestruction: "частково",
        area: "64,65",
        createContent: function () { return ("обличчя  асиметричне (за рахунок колатерального  набряку верхньої третини щічної ділянки  та підочної ділянки праворуч). Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Шкіра обличчя звичайного кольору, помірно зволожена. Регіонарні лімфовузли не пальпуються. Відкривання рота в повному обсязі. " + this.bite + " прикус.  Слизова оболонка ротової порожнини в загальному блідо-рожева, проте гіперемійована та набрякла в ділянці перехідної складки " + this.area + " зубів, випукла, різко болісна при пальпації. Коронка " + this.toothNumber + " зуба " + this.crownDestruction + " зруйнована карієсом, перкусія його різко болісна.") },
      },
      {
        toothNumber: 65,
        createContent: function () { return ("гострий гнійний одонтогенний періостит верхньої щелепи ліворуч від R" + this.toothNumber + " зуба.") }
      },
      {
        name: "Розкриття та дренування періоститу верхньої щелепи ліворуч",
        protocolNumber: 333,
        date: "08.08.19",
        time: "14:30",
        time2: "17:00",
        toothNumber: 65,
        area: "64,65",
        tools: "S-подібних щипців",
        duration: 15,
        anesthetist: "Голінка Ю.Я.",
        createContent: function () {
          return ("Загальне знеболення. Обробка приротової ділянки спиртом двічі, в роті 3% розчином перекисю водню. Проведено розріз до кістки паралельно до перехідної складки в ділянці " + this.area + " зубів, довжиною приблизно 2 см. Тупо москітним затискачем розширено краї рани та пройдено до гнійного осередку. Гнійний вміст об’ємом приблизно 2 мл забрано на бак.посів. Рана дренована гумовим випускником. Видалено " + this.toothNumber + " зуб з допомогою " + this.tools + ". На верхівках коренів видаленого зуба виявлені множинні дрібні гранульоми. Гемостаз по ходу операції. Дитина переведена в палату зі задовільними показниками гемодинаміки.")
        }
      }
    )
    */